tap "adoptopenjdk/openjdk"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "romkatv/powerlevel10k"
# Programmable completion for Bash 3.2
brew "bash-completion"
# X.Org: Library for the Render Extension to the X11 protocol
brew "libxrender"
# Enables you to reproduce the CircleCI environment locally
brew "circleci"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Easiest way to build and release mobile apps
brew "fastlane"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Extensions to follow Vincent Driessen's branching model
brew "git-flow"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# OpenType text shaping engine
brew "harfbuzz"
# Development kit for the Java programming language
brew "openjdk@17"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Colorize logfiles and command output
brew "grc"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# Manage multiple Node.js versions
brew "nvm"
# Development kit for the Java programming language
brew "openjdk"
# Development kit for the Java programming language
brew "openjdk@11"
# Object-relational database system
brew "postgresql@14"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Safe, concurrent, practical language
brew "rust"
# Simple keystroke visualizer
brew "showkey"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vi 'workalike' with many additional features
brew "vim"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# A Zsh Theme
brew "romkatv/powerlevel10k/powerlevel10k"
# Prebuilt OpenJDK binaries
cask "adoptopenjdk8"
# Android SDK component
cask "android-platform-tools"
cask "android-sdk"
# App to build and share containerized applications and microservices
cask "docker"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
